Moneybook/app/controllers/moneybook_controller.rb

SELECT  "moneyinputs".* FROM "moneyinputs" ORDER BY "moneyinputs"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @all_input = Moneyinput.all.reverse

INSERT INTO "moneyinputs" ("date", "style", "category", "content", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["date", "04/22/2018"], ["style", "output"], ["category", "4"], ["content", "브리또"], ["price", 4000], ["created_at", "2018-04-22 12:29:18.477118"], ["updated_at", "2018-04-22 12:29:18.477118"]]
---
    def moneyinput
        moneyinputModel = Moneyinput.new
        moneyinputModel.date = params[:date]
        moneyinputModel.style = params[:style]
        moneyinputModel.category = params[:category]
        moneyinputModel.content = params[:content]
        moneyinputModel.price = params[:price]
        moneyinputModel.save