Group_generator/app/controllers/grouper_controller.rb

  def index
    @all_input = Resultsave.all
---
SELECT "resultsaves".* FROM "resultsaves"

  def result_save

    resultsaveModel = Resultsave.new
    resultsaveModel.team1 = params[:team1]
    resultsaveModel.team2 = params[:team2]
    resultsaveModel.team3 = params[:team3]
    resultsaveModel.tutor1 = params[:tutor1]
    resultsaveModel.tutor2 = params[:tutor2]
    resultsaveModel.tutor3 = params[:tutor3]

    resultsaveModel.save
---
INSERT INTO "resultsaves" ("team1", "team2", "team3", "tutor1", "tutor2", "tutor3", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)